node {
  name: "gru_1_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 148
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "gru_1/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "gru_1/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "gru_1/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "gru_1/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 1190167
    }
  }
}
node {
  name: "gru_1/random_uniform/sub"
  op: "Sub"
  input: "gru_1/random_uniform/max"
  input: "gru_1/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gru_1/random_uniform/mul"
  op: "Mul"
  input: "gru_1/random_uniform/RandomUniform"
  input: "gru_1/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gru_1/random_uniform"
  op: "Add"
  input: "gru_1/random_uniform/mul"
  input: "gru_1/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gru_1/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "gru_1/kernel/Assign"
  op: "Assign"
  input: "gru_1/kernel"
  input: "gru_1/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gru_1/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "gru_1/kernel/read"
  op: "Identity"
  input: "gru_1/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gru_1/kernel"
      }
    }
  }
}
node {
  name: "gru_1/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "]\031\357<\331o\256\2749\343\325\2751g\241\273[6\240=\305\367\252=\347,\202\275N\221\312\274\333\226\211=p\255$>\006\245E>\253\2131\276\343(\304=4Y@>|\026\032\275vx\275=?\030\023\276\212Y\316\275\311(\030>;\004l=\253\240\t\276\215\202q\275a\275\255\275\246\351_\275k\373\245\275\375\346\310<\376\023\251\275\021\0142\273\321\0003>W\014f\276\277\3235\276Zm\'\276\354kN>\247\205\236>)SV=\233\333~>\331|V=\306V\277;A\030\004=\2628M>]h7\275\265k@>d\353,<-H\257<\255\355\332=\222\254\246\275l\264\323<\270\240\365=\302\324\007>\264\203\021\275A\327\022>\377+\340=\000\201\274\275\234\001\366=\220\275\226>\022B\300\2751C\233\275Ld\251=\375\257*\276\306\333e\276\321\273\027>\262i\360\274\341\315H>-\223Y\275\214\375\335<\341\307\262=\037h\316=\037\277R>F8X\275\270u\234=\030\372\037\276\350f\214\276@\262\245<\021\342\021\276sm\253\275\276\222\347\275\257\327\236\275\312\373$\274\244\006\t=\001\316\211>\231\257k\273s\t\211\276\230g\245\275\020\304\'\276M\004\241=\211\325&\274\245\034\322=a\3310=\n\324\250=\212\273@;{%\274\274\341\376p=\377\272r=\310\225\261\275\344\022\360\275\333\300\034\276.\215&\276\227\325%>\276\364;=\017\273E\276\375\272E\276n\355\321\274\313\206\301=\241`\273=\372\017\311;s\265)\275\321\362 \276\315h\220\274;L\222\276:!<=\225\023\276=\3560\303\275\350\350B\276\332\3268=v\312F>\302\333\320=\227\313\372\275\236\005\226>>\260\003=Y\312T\274z\300\241\276\177a+>C\365\216>\3349\250=~%\223>!\317\340=.k\237\275\035\310\216\275\325\304.\275!\022\207=6\006\211\275r\021\252\275 5\036=\305\375\342\275t~@\276\372G\003={\217*; \256\201\274\226kj>\211y]<\336~P>\246\370\005=\365\264\214\275\273\206\374=\216\033R\275\332\006\200=\021\304\346=\006\362\341\275N[\305\274p\243\326=\232d\022\276\010\357c<\201\020\001>G\277\262\275#/s=\322n\275\274\314\264\\>\'<\340=t\205\260\275\266\326\025=X\315\363=\013\230R\276 \270\274=\241tA>\035\247\207=\343:\035;u\336>\276\245\2023=\221DK=snF\274o\371<>@\361\211\275\253\005.\275\370aD\276:l\347\275\340\250\262\275\030\314H>\003b\262\275\276\320\"\276\\`)\276\227^-\276I\332\005\274\307\272\206\275\n\350\207><\276S=\021\224H=\366]\020\275\217S\206\275\315\302t<d\035\003\276\340\027#>\237u5\276\307u\264<\264\262`=\370\275\224>\230\017\232<\217L/\276\313\311\366;8o\034>\221\'\025\276G\350\003\276\004;\226=\002\342\360=|\260\206=\036\334\273\2755\001\023>\tL\271=\3039\225>F\355\177\273\370\226\373\275\026\3463\276\3321\203>8\003\373\275\372P\232\273m\365\375\275C\302\014\276\016\240)=\'\370\203\275\235\0004\276aP\240\275\317$\270<SL\236\274\r\313\344<\253\224\244\275OHn>\030\275p\274\364\371\023\275\027@\250=\206\205\001\276/7\241=\027\262\217=\322:*\276\022\215l\275)\356\327=\305G*\276\007|4>J^\210\276\325\325c<\325\356\270\275L\\\244=\306+\024\276TZ\234=?\371\301=\327\252a>\207|\327<\025\017\022\276\353\017G>i\361&=\030S\016\276+\255\025>J2\275<\350\334C>\016i\\\276zb\007\274\357\246a\276U\242\265\276\\\314\006>b\344u\275\027\003Q<br\320=\242\367\007\275\250L\030>\221:\215\274\230rU>\260.N=\242\322o>M\221\005\274\3336\300=\0267\r\275\306\236\223\275\350\030 \275g\002\361=\202\365`>U\t\205=\343\241\231>\337nx;\352f\300\275#[c\275\224\344\021;_\013>>\022\214\203\275\013\332X>\266u\215=\025\317e\275\360\317\271=\025*\217=\'dC=f\366\352\275[;\326;\350Q\002<\371\234\252\274\317B\337\275\341\331\356\275\236#r=\304\221\247=\323/p=*]\230\275\230e\201=q<&>\307\325\021>N\325\361=\">\035\273\327\277\374\275s\\2\275]\010D>e\266\004\276G\340/=\210\2026\276Xp\267=\307W*\276\201\377\031\276\004\026\003\275\226\241\237<fVT=\206u\320=;\373\020\276\242=\014\276\302\'\326<\376\262\016>\364\005\224\2749\275\035>\3667\250<K\326\244\276\200\253\206>\201\326-\274c\2419=\270\245\320\274ld.\276;\267\361\275#\220)>]\355\346\275\334-\n>\242\354\304;vf0\276\206\032\r\276\003b\207>\232v\217\276\235k\002\276\251/\017>v\3449\274\257!R\275\340<\325\275\323\370P\275\336\024p>\326\272\005=\'\031\312=^,\247=\221\303\322=\030j8>\334&\261=V\313T\275WR2=\356\'e\2753\341u=I\242\002>\257b9=^\3414\276\223\177\021=%0U\275~\235\337=\210!\256\275\274%\032\276\366L\353\274\231\226&>\305\337!\275\360L\343=p\177\021<\252\003V\276Os\204=C\014\301\275\355s\320\275\265\365\234\273\031\005\226=\240O2\276r\250\323\274\275\306[=\302b\020=\252\232\007>r\273\245=+q\000\276\027\004\207=\020\035\033=d\350\023\276\013\206\327<\277\352|=u\261T\276\202\210H>\034\rb=w\217(;k\220\217=\376\356j\275\217k\316\275\311\323\001\276\250/\256>Z(n\275c\325j\276$\376\272=\314\334\377=\365\027\202>q\255D>j\025\213\275N\020\001=\303\217\026>\371\202\025<\212m\240<\262\022\033>i\217\365< O\236\276\275\027E\275:\364E\274<\035%<\367q_>\252\2333\276\234\211\214\274\346\003=>\024\317\345=\277Nq\275\010]\034\276\321=2:\rC8>\373\235\224\275\242\301\234>\352[\354<\212\316 >:6o\275\260\003\024>\271\265\363<\377E\342\274F\312g=\036\024->Ty\363;E\352\267<\2347#>_X\"\274\303\312\345=\272t9\276;)\321\2748\007d\276W\033\022\276~\226\'=\202\355\241=\374\307\317=\t*\225\276\354Z\371\275\022\301\210\2768k\363\275\310MW\276\316\336\226=\224\255f=?\254V=\204\003\253\275SZ\364\274\207\006\260\276wy\256=<e\253=\331\313\225=^\262\264\275(EK\276\347=A=\274 #<\367;\356\275\377>O\275\010RJ\275\022\352\n\276\216n8\276\234\244K\275\212\222\203\274B\231\214;{\037\'\276\255\257\006>\377De\275\277\256\275\275M\303H\276\323\251\006\276\332\242\n\275%\313q\275kg\026>\301\325\223<\014\033\325\2756\023\337<&\255N<\273-\325=\326.S\275v/e=\251XU>\255\021m\276VJ\032\276O\321\241\274q\237\225=\2458\031>\226\304\225\275\204\240\n\276<\325\036\276\352\027\207\275S\275\203=\265\334z\275\325:\213=\261\313E\276\3625=\276=\t\014\276\220 6\275;|\332\274o\353M>\350\033\206>\353Q\020\276\227\224\315=b\265\376\274\345@\002\276k\320\346\275\\?\313\275\277l\216=\335v\220\275\303&$\274\205\2259>\240DQ\276\245?\224<\276\323\230>,\377\227\275\343\006G>\327/\324\2751\272\026\275\241\214\022\276NQ_\274mz\370;\332\227$\276\033Wx=_\263\005\276\253\265\016>\245\377x\276\263\363\350\273I\267\261=\234\014#=\347\350\177=+\374\312=j\003f>\201\004\231=\244\317\034=\003\244\342;u-P>\202\030F=(\t\212\276J\001\246<\226WO<\264\020\262\275[\037\212=\323t*\275=\002\003>O\265\214\275\243m\231={4\375<\347\022|>\254\263\027\276\020a\316\275\245 j<\007\310R\270\251\306O>\257\353K>\363?\324\274\331\177\337=,\264f>#q8>\241\312(\276i\r\327\275\215\335u=(\236\256=\312\023\330=\346\003\265\275F\315\203=?\305X\274-\331\236\275\245s\016\276=\233\233=\256\273\301\275x\036c<Q\350\362\274\'j\027\275F\335\332\273~\260W\274n\343\233\275r\275=\275\240\275b\2760\'\225=$\rC\276\356s5\274 \0173\2760\366\027>\350\000\253\275E\256\031\276\203\242\006\276$\230\220\275\354\244Z\276\210\373%>\3032\276>\251\231\266\274\343\366\003=\200XP\276\243\361\013\276\0021_<_\244\277\275\353J\006>\237\337c\276\274*\006>\244<\314\276\351\007+\276\235\0021\275f\t9>\315L`>\332\200\215<D\217\226<\364j\361\274Q\227\037\276\177UY\274\240\277\217\275\036\374\232>\375\253e\276\236\377\233\275\346\035\016\276\363\344\013\275\303*7\276\n\310\t\2764\314\\=@\2204=\023N;=\327T\312\275?\0265\273\2712T=\3318\013>\262\350\006=\322ZG=\241\344\201>\354\346\222\275\203\312\225=Y.K=uP\035>\020\363\216\274&T\324\275\361\363\346\275\346<\">,\027\027\275\345\375L=\207\017\037=\314\312\357\275H\263Q\276\372\217\241\275J\n\305=\311\330\001>\032\232\223\275\340\216\014>\374\000\330\275m\277&<\335\313\353=\033+\023\275VT%>S/ \276\0075\023>\210T\345<\350v\216\274s\365\313<\2365\242=5S4\275o\216\037>\035\325\227>^\330\031\275\332e\003=\221\315\375=\321Y)\275V\313y\2750\244\033\276\312\033\314;]K?>TT(\274\211\376\272\274\254y%\276\304[\242>B\331\206<o\205\266\275\364U\345\274}PE=\203r\334=\n\213(\275\241\356\264\275\227\300\215\275V\243\236>w\010\322\274iKP>\t\204%\276\025\371*>k\026\010\2761-\356=\200\215\371\275\363$B\276F\331A\275(@\006>i\251\010\276\355[*\274\034\230\225\275\3565\'\276\3007T\2750\004\026>\321\017\313\274Uu|\275\241$d\273T\002;=\332y\241\275\030\006\360\275\237D<\275C[5\274\355\3019\276\261\034\223\275\031\000[>\267\016\371\275~f\021>\007F9\275\036\342\031\276\214|\020\276!\311\324=\303{:=\021=\367\275-Yk\276\237wB=\200{d>j\200e>\210(m>5\266\206\275\221\360\232<\274?\010=\325\322\"\276\252\267]\275\\U\241=\376f\326\275 \2331=5\n\235\275js\230\275/\266:=\271\023\020>\263\0205>y\222\021=\315\"\235\275\222>\022\275\t\303\324\2755\214\231=\214\210P>\223\210Q\274\321\200&\275\265\377\274<\027Q\260\273\312\205Y>q\201\345=s\251-\275\nK\324<\251\2253\275D\216\n>\312\360\200:D\255\036\275X\033\014=+\317\205<\243:\376\275\312\231 =\237\r\017>`\371s>\317o[\273\3018d=:\305\006\276D\324\203=\235!:=n\332\230\276\005\244\215\273\374\332g\276_\352\202\275\316\201\333\275\240\033o=\362\323\261\276\230\2246>\246\033\010\275\272A\203>`\\>\276\343\306\307\274\245V\216\275LCG>\0200\233\274\331\335\222=-\006\332\275\326\201\274;\032\'\017\2767\254\347=\264W(\276\266\031\302=\027:/\276\023\314#\276\253\004.>\264d.>\375\n*\276\337\243\261=\030+\225=\247\273\002>\261\343e\276\224\347A>l\005\206=\376\225\333=TeS\2757\226\027>F}!<z\2073\275f\221\237\275\374\235\363;$8\000\275\022Y\214>]\240\354\274\000\275W\274_{\224\2751\030n\275e\030(\276T\333\r\276\014&\346=\203\352\366\272*\222\321\275m\305\246\275P\t\204\275\220~\377<b\320\231=\r\202\365\275\021e3\276\234\256\331\275\361j\360\275:\360\360=\365\017(\274\032\257_=\003\344\035>9\356\327=\204\364\300\276$\026\004\275\252)\332\274$\313\232\275\241\263\236\275T\"n\276\n\231)=\305\017\243=yjH>\037\200h>)\035\303\275\003\317\n\276\275\316\000\276\304\341F>&s\230=K\004~=\022\344O=T\023L\272~\374(=&UV\275\226\313\006\275\206\275\337\275.dd\275\331\020\200\276\035\r\235\275\361\204\007\275b\307\352\275\235\360\252\275\352*\261\2751t\254=\344w\022\276\241CI\276\366\"\225\275nl,\276\032s\211\273\354\351\031>\004\362O<\302=\004\276!>\027\276\326)\013>j\275f>\265\360\030\276\262\037\257\275\004\340\337\275\312\304\032\276\242\345u\276\371\325\006<\275`\310=\222P\213\274\373\260\266=\332\363\010=2\013\260\274\001n8>\201\361\223\276\n\272\310\276\355\240\t>V T\276Y\203\025<[\345e\275\024D\304=\210Tb\275\273\036R\274Ke\027=\376\312\367=g\027\375=*@\277<\311\261\n>\343\002+>\243B\253;X\346\242\274\032).\275G\001j\2769x\035>\325\357\375\275\002\226\013\275*\315N>k\\\325=(>\037\276\326\225\312=Fz\245=\257\231\037\275\247\0068=\352\n\325=U\306\371=\316_/\276\177\222\305=\345,q=l\032U>\316\324\275<8\224\202\275r\037\304\274\202\246\003\275\303V\331=\247\n\377\275\3513R\276WB8=\377e\302=\354q\200=\333\357\247<\272\351,\276\324\252\212=\210G\346=\334\346-\276^\352\224>\245b\017=\330\257-;\023\241@>\353$\r\276\201\352\310=\330R\205>\211\026\210\274\330a\275\275#\025\277=\3574\304\275g!v\274\003sV\275^X\271\275\241\223^\275\324\344\014\275\303\373\370\275\350!\270<c\313\000=)$\034=\216\245\"=\257\216\375=\245\243\242\276\363\023\224>\307\"Q\276\260\357R=D\017G\274\"\353\343\275\\\247\031:\026\325\300=\305\220I>\303\371\204\276\335\230+>\346\021^=\260E5<\206bK\276\2205f\276\006\266\341\275\202\026B>\377\006\203\275\326\340\303\274\202\274Y\275W\340\203\276\254%\355\272(\330o<B\002+\276\241J\033\276\322k\330\274m\016B\275\004\276\032\276\023K\264<T^\033\276/\307t\276|\337(\274\205\250\347\275\020-[=962\275\025\246\351\275\321\262\345=3X\214\274\010\031D\275\374Fe=\n\252\216\275\361\245};\005\006C\276\305\200\334\275\270\021\032=\3551:\275[\337d>\376\372\314\275e\347\344=u\245\202\275\242\273N>M\033\016>\360\211\311\275\t\024\001\276%\377\024>4A\257\274k\2423\276\034\026\203\275\214\350O=\265?-=\254&\000>D\255\224>\316u\272\275?\213M\276\235+\251\275\372\350\347<\354\r\334=\334\037:>\271\327\026\276\356\027N=\372T\262\275;\r#>4\340\032>\036\177Q=~\301\031=\275\230\247<\324\023\332\274\215A\366\275w\273\255\275dwL\276&.\030>r\373\221\275\315\206\201<\207\037\010\276<\375\341=\230\020\001>q\316\036=%&\361=\374\177\024\275bPB=\262O\202\275\"\345\325=\355aS>:F\003\275\277\177U>~\356\243=,\217\260=\271\253\343=\2769i==\357\030\274\364\022\035\276w\3766\276\027\204\206\275\255\016\271\275\024?\323;\005\356\n=`t\325=*\261`>\037\'\215>d}\207\275\302\251\252\276\267\203\324=~n\214\2753\341\017>\373\305`>\010\317Z\276\277\352\216\275\334w\224;a\212\026>n^\337=\252\222\347:\210\310\271=pC\210<\245\304?\276\240\333\004\275\026jl\276\310A\256\275\246\370\263=@\302\331<\250\251\233>\335\016Q\274\003$\367\275|\377\215=$\001\034=\264$\020\276M\220\233\275&\372\022\276\022\243-\276\230\371\030\276K\035\316\273\216\306\006\275\250\000\030>Z!\035\276\337!i\275Xw4>\213G:\276\257<\230=\345\262\n>\357\0175>\336\033\350\2751\354J\276!\"\014\275\344\202!\276+\2040=\017\334\207\274\342\346\260\275\275b\224>\331\372\202<M\200\215\275\375\206\265\275V\275\010=\362>\235=\345\353J\276\233\022J>\361X\322=\250qN\271\262\320%\276\274L\273\275\236D\315\274J\350\241\275 C\017\274\310\377\215=r\n\263\275\013\013\002\276\317[5>\237\013\253\274x$\224\275hE\205>\022\277>\275\320\266\231\2754\322s\274+d \276\355,\343\275\213\335*>\037\007\016>\360\331t\276*\355#\273\205\235\t\276\223\226\350<m=\t>\177J\200\276\234\023\037\275\325g\261\275\001\336\326\275V\330\033\276`+1>#\215\304\274\344\274^\275\367U,\276\037\343\235:w0\020\276W\265&>6\022m\275\023\350\236\274/\212\213\276#\023\t;4h\315=\364\267\"=\267\006\366\275\005\342\244=;\213\200\275\024D\004\276\272\275\210>z\2531>\331\374\361\275C\025\024>\351\336%<\306\377\204\275\017\0329>g\213h\275\033\247(=Z\035\324\275h\033!\275\372\316\335\276\366\305\211\275\340x;\272\310.\255\275\355\245\313\275>\214\355\275\032\312\250=eI\336<\363x-\276\274\265C\276\3212\017=\2120\332<\030\376F=\264=9<\330\360C>\250\321\211<\377\035M>\r\243\310\274\200}\257\273t\"\243\275\t\311:=9\254+\276\220\225\354\275"
      }
    }
  }
}
node {
  name: "gru_1/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "gru_1/recurrent_kernel/Assign"
  op: "Assign"
  input: "gru_1/recurrent_kernel"
  input: "gru_1/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gru_1/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "gru_1/recurrent_kernel/read"
  op: "Identity"
  input: "gru_1/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gru_1/recurrent_kernel"
      }
    }
  }
}
node {
  name: "gru_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "gru_1/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "gru_1/bias/Assign"
  op: "Assign"
  input: "gru_1/bias"
  input: "gru_1/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gru_1/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "gru_1/bias/read"
  op: "Identity"
  input: "gru_1/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@gru_1/bias"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice"
  op: "StridedSlice"
  input: "gru_1/kernel/read"
  input: "gru_1/strided_slice/stack"
  input: "gru_1/strided_slice/stack_1"
  input: "gru_1/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "gru_1/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_1"
  op: "StridedSlice"
  input: "gru_1/recurrent_kernel/read"
  input: "gru_1/strided_slice_1/stack"
  input: "gru_1/strided_slice_1/stack_1"
  input: "gru_1/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "gru_1/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_2"
  op: "StridedSlice"
  input: "gru_1/kernel/read"
  input: "gru_1/strided_slice_2/stack"
  input: "gru_1/strided_slice_2/stack_1"
  input: "gru_1/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "gru_1/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_3"
  op: "StridedSlice"
  input: "gru_1/recurrent_kernel/read"
  input: "gru_1/strided_slice_3/stack"
  input: "gru_1/strided_slice_3/stack_1"
  input: "gru_1/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "gru_1/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_4"
  op: "StridedSlice"
  input: "gru_1/kernel/read"
  input: "gru_1/strided_slice_4/stack"
  input: "gru_1/strided_slice_4/stack_1"
  input: "gru_1/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "gru_1/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_5"
  op: "StridedSlice"
  input: "gru_1/recurrent_kernel/read"
  input: "gru_1/strided_slice_5/stack"
  input: "gru_1/strided_slice_5/stack_1"
  input: "gru_1/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "gru_1/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_6"
  op: "StridedSlice"
  input: "gru_1/bias/read"
  input: "gru_1/strided_slice_6/stack"
  input: "gru_1/strided_slice_6/stack_1"
  input: "gru_1/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "gru_1/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_7"
  op: "StridedSlice"
  input: "gru_1/bias/read"
  input: "gru_1/strided_slice_7/stack"
  input: "gru_1/strided_slice_7/stack_1"
  input: "gru_1/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "gru_1/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_8"
  op: "StridedSlice"
  input: "gru_1/bias/read"
  input: "gru_1/strided_slice_8/stack"
  input: "gru_1/strided_slice_8/stack_1"
  input: "gru_1/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "gru_1/zeros_like"
  op: "ZerosLike"
  input: "gru_1_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gru_1/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/Sum"
  op: "Sum"
  input: "gru_1/zeros_like"
  input: "gru_1/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "gru_1/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "gru_1/ExpandDims"
  op: "ExpandDims"
  input: "gru_1/Sum"
  input: "gru_1/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gru_1/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/Tile"
  op: "Tile"
  input: "gru_1/ExpandDims"
  input: "gru_1/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gru_1/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_9"
  op: "StridedSlice"
  input: "gru_1_input"
  input: "gru_1/strided_slice_9/stack"
  input: "gru_1/strided_slice_9/stack_1"
  input: "gru_1/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 5
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 5
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "gru_1/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\r\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/Reshape"
  op: "Reshape"
  input: "gru_1/strided_slice_9"
  input: "gru_1/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gru_1/ones_like/Shape"
  op: "Shape"
  input: "gru_1/Reshape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gru_1/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "gru_1/ones_like"
  op: "Fill"
  input: "gru_1/ones_like/Shape"
  input: "gru_1/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gru_1/mul/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "gru_1/mul"
  op: "Mul"
  input: "gru_1/ones_like"
  input: "gru_1/mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gru_1/dropout/keep_prob"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.800000011920929
      }
    }
  }
}
node {
  name: "gru_1/dropout/Shape"
  op: "Shape"
  input: "gru_1/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gru_1/dropout/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "gru_1/dropout/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "gru_1/dropout/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "gru_1/dropout/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 12905
    }
  }
}
node {
  name: "gru_1/dropout/random_uniform/sub"
  op: "Sub"
  input: "gru_1/dropout/random_uniform/max"
  input: "gru_1/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gru_1/dropout/random_uniform/mul"
  op: "Mul"
  input: "gru_1/dropout/random_uniform/RandomUniform"
  input: "gru_1/dropout/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gru_1/dropout/random_uniform"
  op: "Add"
  input: "gru_1/dropout/random_uniform/mul"
  input: "gru_1/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gru_1/dropout/add"
  op: "Add"
  input: "gru_1/dropout/keep_prob"
  input: "gru_1/dropout/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gru_1/dropout/Floor"
  op: "Floor"
  input: "gru_1/dropout/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gru_1/dropout/div"
  op: "RealDiv"
  input: "gru_1/mul"
  input: "gru_1/dropout/keep_prob"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gru_1/dropout/mul"
  op: "Mul"
  input: "gru_1/dropout/div"
  input: "gru_1/dropout/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gru_1/ExpandDims_1/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "gru_1/ExpandDims_1"
  op: "ExpandDims"
  input: "gru_1/dropout/mul"
  input: "gru_1/ExpandDims_1/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gru_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\224\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/Tile_1"
  op: "Tile"
  input: "gru_1/ExpandDims_1"
  input: "gru_1/stack"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gru_1/mul_1"
  op: "Mul"
  input: "gru_1_input"
  input: "gru_1/Tile_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gru_1/Reshape_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\r\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/Reshape_1"
  op: "Reshape"
  input: "gru_1_input"
  input: "gru_1/Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gru_1/MatMul"
  op: "MatMul"
  input: "gru_1/Reshape_1"
  input: "gru_1/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "gru_1/BiasAdd"
  op: "BiasAdd"
  input: "gru_1/MatMul"
  input: "gru_1/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "gru_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\377\377\377\377\224\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/Reshape_2"
  op: "Reshape"
  input: "gru_1/BiasAdd"
  input: "gru_1/stack_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gru_1/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/strided_slice_10"
  op: "StridedSlice"
  input: "gru_1_input"
  input: "gru_1/strided_slice_10/stack"
  input: "gru_1/strided_slice_10/stack_1"
  input: "gru_1/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 5
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 5
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 2
    }
  }
}
node {
  name: "gru_1/Reshape_3/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\r\000\000\000"
      }
    }
  }
}
node {
  name: "gru_1/Reshape_3"
  op: "Reshape"
  input: "gru_1/strided_slice_10"
  input: "gru_1/Reshape_3/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gru_1/ones_like_1/Shape"
  op: "Shape"
  input: "gru_1/Reshape_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gru_1/ones_like_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "gru_1/ones_like_1"
  op: "Fill"
  input: "gru_1/ones_like_1/Shape"
  input: "gru_1/ones_like_1/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gru_1/mul_2/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "gru_1/mul_2"
  op: "Mul"
  input: "gru_1/ones_like_1"
